# -----------------------------------------------------------------------------
# Homebrew taps
# -----------------------------------------------------------------------------

# tap 'homebrew/cask'
# tap 'homebrew/bundle'

# -----------------------------------------------------------------------------
# Settings
# -----------------------------------------------------------------------------

# Define where to put installed applications
cask_args appdir: '/Applications'

# Allow installation of AppStore applications
brew 'mas'

# -----------------------------------------------------------------------------
# Applications to install
# -----------------------------------------------------------------------------

# Network
brew 'curl'
brew 'wget'

# Terminal
brew 'zsh'
brew 'powerlevel10k'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
cask 'alacritty'

# Web
cask 'google-chrome'

# Development
brew 'git'
brew 'neovim'
brew 'tmux'
brew 'node'
cask 'font-fira-code-nerd-font'
cask 'github'
cask 'visual-studio-code'

# Communication
mas 'LINE', id: 539883307

# Office and productivity
cask 'libreoffice'
cask 'obsidian'
cask 'notion'

# GitHub Pages
brew 'hugo'

# -----------------------------------------------------------------------------
# Visual Studio Code extensions
# -----------------------------------------------------------------------------

# Navigation
vscode "asvetliakov.vscode-neovim"

# Language
vscode "ms-vscode.cpptools"
vscode "ms-python.python"

# Markdown tools
vscode "shd101wyy.markdown-preview-enhanced"

# Theme
vscode "arcticicestudio.nord-visual-studio-code"

# Code formater/beautifier
vscode "esbenp.prettier-vscode"

# Docker
vscode "ms-azuretools.vscode-docker"