tap "anomalyco/tap"
brew "fzf"
brew "lazygit"
brew "neovim"
brew "node"
brew "nvm"
brew "pnpm"
brew "ripgrep"
brew "stow"
brew "tmux"
brew "tree"
brew "uv"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "anki"
cask "claude"
cask "claude-code"
cask "feishu"
cask "font-jetbrains-mono-nerd-font"
cask "wezterm"
cask "firefox"
cask "raycast"
