tap "anomalyco/tap"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "lazygit"
brew "neovim"
brew "node"
brew "nvm"
brew "ollama", restart_service: :changed
brew "pnpm"
brew "ripgrep"
brew "starship"
brew "stow"
brew "syncthing", restart_service: :changed
brew "tmux"
brew "tree"
brew "uv"
brew "wget"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "anomalyco/tap/opencode"
cask "anki"
cask "claude"
cask "claude-code"
cask "feishu"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "obsidian"
cask "raycast"
cask "visual-studio-code"
cask "whatsapp"
vscode "anthropic.claude-code"
vscode "asvetliakov.vscode-neovim"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "github.vscode-github-actions"
vscode "lokalise.i18n-ally"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "pkief.material-icon-theme"
vscode "svelte.svelte-vscode"
