tap "nikitabobko/tap"
brew "eza"
brew "fd"
brew "fzf"
brew "node"
brew "gemini-cli"
brew "git-lfs"
brew "lazygit"
brew "neovim"
brew "nvm"
brew "openjdk"
brew "pnpm"
brew "postgresql@15"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tmux"
brew "tree"
brew "uv"
brew "wget"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "aerospace"
cask "chatwise"
cask "codex"
cask "dbngin"
cask "discord"
cask "docker-desktop"
cask "feishu"
cask "figma"
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "github"
cask "google-chrome"
cask "obsidian"
cask "postman"
cask "raycast"
cask "visual-studio-code"
cask "whatsapp"
